<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\Illness;

class IllnessSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        Illness::create([
            // 'id' => 0,
            'title' => 'ГРВІ',
            'description' => 'Хоча у медицині відсутнє офіційне термінологічне позначення "застуда", це всього лише популярна назва для гострої респіраторної вірусної інфекції (ГРВІ). У слові "респіраторна" відображено те, що вірус викликає запалення в органах дихальної системи. Існує понад 200 видів респіраторних вірусів, кожен з яких має свої особливості. ',
        ]);
        Illness::create([
            //'id' => 1,
            'title' => 'Covid_19',
            'description' => 'Коронавірусна інфекція (COVID-19) - викликана вірусом SARS-CoV-2, проявляється легкими та помірними симптомами у більшості інфікованих. У деяких осіб вона може приймати важку форму, особливо в літніх та хворих на інші захворювання.

            Зараження можливо для всіх, але важкі наслідки частіше стосуються груп ризику, таких як літні люди та ті, хто має хронічні захворювання. Основні заходи для запобігання передачі включають носіння масок, дотримання соціальної дистанції та часте миття рук.
            
            Вірус передається через рот або ніс інфікованої особи, особливо під час кашлю, чхання, розмови або дихання. Розмір частинок може варіюватися, тому важливо дотримуватися респіраторного етикету та ізолюватися в разі поганих самопочуття.',
        ]);
        Illness::create([
            //'id' => 2,
            'title' => 'Грип',
            'description' => 'Грип - гостре респіраторне вірусне захворювання, яке передається повітряно-крапельним шляхом. Викликає його віруси типу A, B, C. Хвороба починається загальною інтоксикацією, супроводжується головним болем, м`язовими болями та різким підвищенням температури.

            Спалах може виникнути через контакт з інфікованою особою або з вірусоносієм. Симптоми включають сильний озноб, головний біль, слабкість, біль у горлі, кашель, запаморочення та світлобоязнь.
            
            Тривалість хвороби може коливатися, з інтенсивним кашлем, носовими кровотечами та іншими проявами. Легкий перебіг супроводжується слабко вираженими симптомами, температурою до 38 °C. Середній перебіг включає важкість інтоксикації та температурні коливання до 39 °C. Блискавичний перебіг може призвести до швидкого загострення симптомів та, важче, навіть призвести до смерті через ускладнення, такі як набряк легень та серцево-судинна недостатність.',
        ]);
        Illness::create([
            //'id' => 3,
            'title' => 'Бронхіт',
            'description' => 'Бронхіт - це захворювання нижніх дихальних шляхів, при якому відбувається запальне ураження слизової оболонки бронхів. Це хрящові труби, які переходять від трахеї до легеневих альвеол. Запалення може охоплювати весь бронхіальний тракт або його окремі частини, але воно не впливає на альвеоли, як у випадку пневмонії.

            Бронхіт становить одну з найпоширеніших причин звернення до медичної допомоги. Його основні викликачі - віруси (грип, парагрип, риновіруси та інші) та бактерії (пневмококи, гемофільна паличка, стрептококи та інші). Рідше бронхіти можуть бути спричинені грибками, алергенами або токсичними речовинами.
            
            Хворобу передають головним чином повітряно-крапельним шляхом, тобто при вдиханні інфікованих краплин слини під час контакту з хворою особою (під час розмови, кашлю, чхання). Часто розвитку захворювання передує охолодження.',
        ]);
        Illness::create([
            //'id' => 4,
            'title' => 'Отит',
            'description' => 'Отит – отоларингологічне захворювання, що виникає внаслідок запалення тканин вуха та супроводжується болем. Основні класифікації включають зовнішній, середній та лабіринтит, розрізняють гострий (до 3 тижнів) та хронічний (понад 3 місяці) типи, а також катаральні та гнійні форми за характером запального ексудату.

            Причини отиту різноманітні, зазвичай викликані бактеріями, вірусами чи грибками. Інфікування може відбуватися контактно, через носові відділи при кашлі чи чханні, а також через хронічні інфекційні вогнища.
            
            Чинники, які сприяють захворюванню, включають наявність інших ЛОР-патологій, переохолодження чи перегрівання, неправильний догляд, зниження імунітету, травми та інші негативні впливи.
            
            Основні симптоми гострого отиту включають біль, збільшення лімфовузлів, підвищення температури тіла, зменшення болю після розтину гнійника та витікання гною зі слухового проходу.',
        ]);
        Illness::create([
            //'id' => 5,
            'title' => 'Ларингіт',
            'description' => 'Ларингіт - гостре запалення слизової оболонки гортані та голосових складок, може бути самостійним або виникати в результаті запальних процесів носоглотки (кір, коклюш, грип). Як самостійне захворювання, ларингіт розвивається при активації природної флори гортані внаслідок переохолодження, перенапруження голосових складок, або вживання алкоголю та тютюну.',
        ]);
        Illness::create([
            //'id' => 6,
            'title' => 'Ангіна',
            'description' => 'Гострий тонзиліт (ангіна) - інфекційне захворювання з запальним процесом гланд, спричинене стрептококами або стафілококами. Хвороба передається повітряно-крапельним шляхом або фекально-орально (герпетична ангіна). Контакт з інфікованою особою може призвести до передачі мікроорганізмів і розвитку захворювання. Наявність умов, що сприяють активації власних мікроорганізмів, може також викликати ангіну. Важливо враховувати заразливість хвороби і не ігнорувати симптоми, оскільки це може мати наслідки для хворого і оточуючих.',
        ]);
    }
}
